[
    {
        "name": "JAVA PROGRAMMING LAB",
        "code": "JAVAL",
        "units": [
            {
                "name": "List of Experiments",
                "topics": [
                    {
                        "topic": "1. Use Eclipse or Net bean platform and acquaint yourself with the various menus. Create a test project, add a test class, and run it. See how you can use auto suggestions, auto fill. Try code formatter and code refactoring like renaming variables, methods, and classes. Try debug step by step with a small program of about 10 to 15 lines which contains at least one if else condition and a for loop.",
                        "subTopics": []
                    },
                    {
                        "topic": "2. Write a Java program to demonstrate the OOP principles. [i.e., Encapsulation, Inheritance, Polymorphism and Abstraction]",
                        "subTopics": []
                    },
                    {
                        "topic": "3. Write a Java program to handle checked and unchecked exceptions. Also, demonstrate the usage of custom exceptions in real-time scenario.",
                        "subTopics": []
                    },
                    {
                        "topic": "4. Write a Java program on Random Access File class to perform different read and write operations.",
                        "subTopics": []
                    },
                    {
                        "topic": "5. Write a Java program to demonstrate the working of different collection classes. [Use package structure to store multiple classes].",
                        "subTopics": []
                    },
                    {
                        "topic": "6. Write a program to synchronize the threads acting on the same object. [Consider the example of any reservations like railway, bus, movie ticket booking, etc.]",
                        "subTopics": []
                    },
                    {
                        "topic": "7. Write a program to perform CRUD operations on the student table in a database using JDBC.",
                        "subTopics": []
                    },
                    {
                        "topic": "8. Write a Java program that works as a simple calculator. Use a grid layout to arrange buttons for the digits and for the +, -,*, % operations. Add a text field to display the result. Handle any possible exceptions like divided by zero.",
                        "subTopics": []
                    },
                    {
                        "topic": "9. Write a Java program that handles all mouse events and shows the event name at the center of the window when a mouse event is fired. [Use Adapter classes]",
                        "subTopics": []
                    }
                ]
            }
        ],
        "links": []
    }
]