[
  {
    "name": "NODE JS/ REACT JS/ DJANGO",
    "code": "NEDJ",
    "units": [
      {
        "name": "Exercises",
        "topics": [
          {
            "topic": "1. Build a responsive web application for shopping cart with registration, login, catalog and cart pages using CSS3 features, flex and grid.",
            "subTopics": []
          },
          {
            "topic": "2. Make the above web application responsive web application using Bootstrap framework.",
            "subTopics": []
          },
          {
            "topic": "3. Use JavaScript for doing client – side validation of the pages implemented in experiment 1 and experiment 2.",
            "subTopics": []
          },
          {
            "topic": "4. Explore the features of ES6 like arrow functions, callbacks, promises, async/await. Implement an application for reading the weather information from openweathermap.org and display the information in the form of a graph on the web page.",
            "subTopics": []
          },
          {
            "topic": "5. Develop a java stand alone application that connects with the database (Oracle / mySql) and perform the CRUD operation on the database tables.",
            "subTopics": []
          },
          {
            "topic": "6. Create an xml for the bookstore. Validate the same using both DTD and XSD.",
            "subTopics": []
          },
          {
            "topic": "7. Design a controller with servlet that provides the interaction with application developed in experiment 1 and the database created in experiment 5.",
            "subTopics": []
          },
          {
            "topic": "8. Maintaining the transactional history of any user is very important. Explore the various session tracking mechanism (Cookies, HTTP Session)",
            "subTopics": []
          },
          {
            "topic": "9. Create a custom server using http module and explore the other modules of Node JS like OS, path, event.",
            "subTopics": []
          },
          {
            "topic": "10. Develop an express web application that can interact with REST API to perform CRUD operations on student data. (Use Postman)",
            "subTopics": []
          },
          {
            "topic": "11. For the above application create authorized end points using JWT (JSON Web Token).",
            "subTopics": []
          },
          {
            "topic": "12. Create a react application for the student management system having registration, login, contact, about pages and implement routing to navigate through these pages.",
            "subTopics": []
          },
          {
            "topic": "13. Create a service in react that fetches the weather information from openweathermap.org and the display the current and historical weather information using graphical representation using chart.js",
            "subTopics": []
          },
          {
            "topic": "14. Create a TODO application in react with necessary components and deploy it into github.",
            "subTopics": []
          }
        ]
      }
    ],
    "links": []
  }
]