[
    {
        "name": "PROLOG/ LISP/ PYSWIP",
        "code": "PLP",
        "units": [
            {
                "name": "List of Programs",
                "topics": [
                    {
                        "topic": "1. Write simple fact for following:",
                        "subTopics": [
                            "A. Ram likes mango.",
                            "B. Seema is a girl.",
                            "C. Bill likes Cindy.",
                            "D. Rose is red.",
                            "E. John owns gold"
                        ]
                    },
                    {
                        "topic": "2. Write predicates one converts centigrade temperatures to Fahrenheit, the other checks if a temperature is below freezing.",
                        "subTopics": []
                    },
                    {
                        "topic": "3. Write a program to solve the Monkey Banana problem",
                        "subTopics": []
                    },
                    {
                        "topic": "4. WAP in turbo prolog for medical diagnosis and show the advantages and disadvantages of green and red cuts.",
                        "subTopics": []
                    },
                    {
                        "topic": "5. Write a program to solve the 4-Queen problem.",
                        "subTopics": []
                    },
                    {
                        "topic": "6. Write a program to solve traveling salesman problems.",
                        "subTopics": []
                    },
                    {
                        "topic": "7. Write a program to solve water jug problems using Prolog.",
                        "subTopics": []
                    },
                    {
                        "topic": "8. Write simple Prolog functions such as the following. Take into account lists which are too short.",
                        "subTopics": [
                            "-- remove the Nth item from the list.",
                            "-- insert as the Nth item."
                        ]
                    },
                    {
                        "topic": "9. Assume the prolog predicate gt(A, B) is true when A is greater than B. Use this predicate to define the predicate addLeaf(Tree, X, NewTree) which is true if NewTree is the Tree produced by adding the item X in a leaf node. Tree and NewTree are binary search trees. The empty tree is represented by the atom nil.",
                        "subTopics": []
                    },
                    {
                        "topic": "10. Write a Prolog predicate, countLists(Alist, Ne, Nl), using accumulators, that is true when Nl is the number of items that are listed at the top level of Alist and Ne is the number of empty lists.",
                        "subTopics": []
                    },
                    {
                        "topic": "11. Define a predicate memCount(AList,Blist,Count) that is true if Alist occurs Count times within Blist. Define without using an accumulator. Use 'not' as defined in utilities.pro, to make similar cases are unique, or else you may get more than one count as an answer.",
                        "subTopics": []
                    }
                ]
            }
            
        ],
        "links": []
    }
  ]
  